{"review_id":"p7GUxLtjlpGQ4cCMohdttQ","user_id":"_XSTr28i4hAZrvxc9nG0EQ","business_id":"6mnjYZM40r67smOXrg6R4g","stars":2,"date":"2016-12-31","text":"I've been to this Benvenuto's about once a year since it opened. Each visit the experience gets more disappointing. Let me say I really want this restaurant to succeed. This location is perfect for the Northside community. This visit was with a group of 7 women. The host was friendly but in a rushed robotic way, he made no eye contact, just recited the expected welcome and thank you phrase. There are a lot of elderly folks that eat here, having someone opening doors for them would be good. We were seated at a nice table with plenty of room for all of us. I like the cloth tablecloth, I hate the sheet of paper over it. My sleeves were constantly getting caught on it. In past visits I enjoyed the server coming to the table and making a production of pouring olive oil on a plate with herbs and then grinding fresh black pepper into it. The server would deliver fresh warm <bread> in a cloth covered basket. That did not happen this visit. There were two plates with dried herbs and a small bottle of olive oil on the table. No explanation that <bread> would be coming, as a matter of fact it didn't come until we had our drinks. There are huge hard cover menus. It would have been important for the server to take a few minutes to talk about the dinner menu and the appetizer, <wine> menu. I love seafood and looked forward to the <Shrimp Scampi Capellini> which was described as having jumbo scallops, shrimp and crab. The bowl of <capellini> arrived with 3 nickel size scallops, 5 shrimp and pieces of brown seafood that may have been crab. The shrimp still had the tails which meant I had to eat it using my fingers (I hate doing that with a pasta dish!) This was a $12-15 meal not the $23.50 charged. I had a <salad> (included with dinner). It was fresh and had a good mix of expected salad ingredients. The woman next to me ordered <Portabella Penne>-her first comment was \"this is weird, it has too much basalmic sauce\" It was way over sauced to the point of not being able to identify other ingredients. She commented that to the server who didn't offer any solution even after it was clear my friend wasn't eating her meal. Several of us asked for extra parmesan. The server came out with a big hunk of cheese and a grater. That was a fun touch until each of us had a pile of grated cheese on our laps-even though all of us held our hands out over our bowls to try and keep the cheese going the right direction. The server brought me a glass of <water> as requested but never refilled empty water glasses for the rest of the group and it was all they were drinking. I feel like the restaurant has let the special touches become a boring routine and needs to really address quality control. The prices on the menu are way too high. Even the nightly \"specials\" were priced too high. I would pay those prices for a memorable meal. Unfortunately I wouldn't recommend a visit.","useful":0,"funny":0,"cool":0,"type":"review","restaurant":{"name":"Benvenuto's Italian Grill","neighborhood":"Sherman","address":"1849 Northport Dr","city":"Madison","state":"WI","postal_code":"53704","latitude":43.1288990362,"longitude":-89.3600500521,"stars":3.0,"review_count":40,"is_open":1,"attributes":["Alcohol: full_bar","Ambience: {'romantic': False, 'intimate': False, 'classy': False, 'hipster': False, 'divey': False, 'touristy': False, 'trendy': False, 'upscale': False, 'casual': True}","BikeParking: True","BusinessAcceptsCreditCards: True","BusinessParking: {'garage': False, 'street': False, 'validated': False, 'lot': True, 'valet': False}","Caters: True","DogsAllowed: False","GoodForKids: True","HasTV: True","NoiseLevel: average","OutdoorSeating: False","RestaurantsAttire: casual","RestaurantsDelivery: True","RestaurantsGoodForGroups: True","RestaurantsPriceRange2: 2","RestaurantsReservations: True","RestaurantsTableService: True","RestaurantsTakeOut: True","WheelchairAccessible: True","WiFi: free","GoodForMeal: {'dessert': False, 'latenight': False, 'lunch': True, 'dinner': True, 'breakfast': False, 'brunch': False}"],"categories":["Restaurants","Italian"],"hours":["Monday 11:0-22:0","Tuesday 11:0-22:0","Wednesday 11:0-22:0","Thursday 11:0-22:0","Friday 11:0-22:0","Saturday 11:0-22:0","Sunday 11:0-22:0"],"type":"business"},"user":{"name":"René","review_count":13,"yelping_since":"2009-03-15","friends":["n7G6NkglWDrw8UfpsQAf4w"],"useful":2,"funny":1,"cool":0,"fans":0,"elite":["None"],"average_stars":3.72,"compliment_hot":0,"compliment_more":0,"compliment_profile":0,"compliment_cute":0,"compliment_list":0,"compliment_note":0,"compliment_plain":0,"compliment_cool":0,"compliment_funny":0,"compliment_writer":1,"compliment_photos":0,"type":"user"}}
