{"review_id":"mJsa-9EBzk7iUAmpK9oQ6w","user_id":"Jo65-J1-PfwYhilYJ8mM_g","business_id":"9ismhhkIPREHOo8tJi0ETA","stars":3,"date":"2012-11-25","text":"Tonight was our first trip to Ruth's.  We used a Groupon coupon.  We'd never been here before because I knew it was pricey.  I didn't realize just how pricey.  Yikes!  \n\nOur drink and appetizer orders were taken promptly.  Another employee came around with a tray with 2 large bottles of water on it.  He asked it we wanted one of these or tap water. He had a strong accent so was a bit tough to understand.  My husband chose a water but luckily I asked how much it was.  For $4.95, we decided we could both be happy with tap water. \n\nWe started off with the <stuffed mushrooms>.  They were large and very tasty but we only got 4 for $12.50.  They weren't any better than the ones at Olive Garden or Red Lobster.  \n\nMy husband had the <seared scallops> ($28), which he said were excellent.  They were served over a bed of thin sliced zucchini and red peppers which looked wonderful.\n\nI had the <ribeye> ($43, 16oz).  My <steak> was good but I think it must have had butter on it or something, as it was a bit greasy.  I ordered it medium rare but it was more on the rare side.  Luckily, I didn't mind but my husband, who likes his meat fairly well done, was grossed out.  The <ribeye> was only a couple bucks more than the 11oz filet & I was able to bring half home for another meal.  I'll probably be glad it was on the rare side when I reheat it.  Altho the <steak> was good, it wasn't exceptionally better than any other <steak> I've had, which I expected considering the price.\n\nThe meal includes a small loaf of fresh hot <bread> which was light and fluffy on the inside with a nicely crispy crust.  It does NOT include anything else,.  <Salads> or sides are extra.  The sides are large, so my husband and I shared the <au gratin potatoes>, which were very good ($8.50).\n\nThe service was very good and the manager came around to see how things were going.  It was cold in the room we were in but the cold air blowing thru the vents was promptly shut off when another diner made the request.  I had a big complaint about the ambiance as they were playing Xmas music non-stop.  A few tunes here and there would have been fine but not one right after another.  I asked if they could put on some different music but no change was ever made.  We were ready to leave by the time the manager came over, so I didn't bother to mention the music.\n\nMy husband seemed to be really impressed by the fact there was a TV in the men's room.  Guys never spend much time in the restroom so I found the TV rather funny.\n\nWould we go back?  No.  I really didn't feel like we got enuf bang for our buck.  \nAt the prices they're charging for the main courses, a <salad> and side dish should be included.  The food just wasn't exceptional enough for the prices.","useful":1,"funny":0,"cool":0,"type":"review","restaurant":{"name":"Ruth's Chris Steak House","neighborhood":"","address":"2137 Deming Way","city":"Middleton","state":"WI","postal_code":"53562","latitude":43.0974832,"longitude":-89.5229633,"stars":3.5,"review_count":78,"is_open":1,"attributes":["Alcohol: full_bar","BikeParking: False","BusinessAcceptsCreditCards: True","BusinessParking: {'garage': False, 'street': False, 'validated': False, 'lot': True, 'valet': False}","Caters: False","GoodForKids: False","GoodForMeal: {'dessert': False, 'latenight': False, 'lunch': False, 'dinner': True, 'breakfast': False, 'brunch': False}","HasTV: True","NoiseLevel: quiet","OutdoorSeating: False","RestaurantsAttire: dressy","RestaurantsDelivery: False","RestaurantsGoodForGroups: True","RestaurantsPriceRange2: 3","RestaurantsReservations: True","RestaurantsTableService: True","RestaurantsTakeOut: True","WheelchairAccessible: True","WiFi: no","Ambience: {'romantic': False, 'intimate': False, 'classy': False, 'hipster': False, 'divey': False, 'touristy': False, 'trendy': False, 'upscale': False, 'casual': False}"],"categories":["Steakhouses","Restaurants"],"hours":["Monday 17:0-22:0","Tuesday 17:0-22:0","Wednesday 17:0-22:0","Thursday 17:0-22:0","Friday 17:0-23:0","Saturday 17:0-23:0","Sunday 16:0-21:0"],"type":"business"},"user":{"name":"Jillian","review_count":6,"yelping_since":"2012-11-25","friends":["cKJ5gclr8MI7RiXXbciCwQ","479xiZrti6Cc-TpdxbZY-w","LtUHv_AhJdQx3b-Geb-h4Q"],"useful":0,"funny":0,"cool":0,"fans":0,"elite":["None"],"average_stars":3.33,"compliment_hot":0,"compliment_more":0,"compliment_profile":0,"compliment_cute":0,"compliment_list":0,"compliment_note":1,"compliment_plain":0,"compliment_cool":0,"compliment_funny":0,"compliment_writer":0,"compliment_photos":0,"type":"user"}}
